In [ ]:
##Script for Fetching Data from PostgreSQL

import psycopg2
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

engine=create_engine("dialect+driver://username:password@host:port/database_name")

df=pd.read_sql("Write a SQL query to fetch the required data from the database/table",engine)

print(df.head())

In [ ]:
##Script for Fetching Data from MySQL

import psycopg2
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

engine=create_engine("mysql+pymysql://root:password@localhost:3306/database_name")

df=pd.read_sql("Write a SQL query to fetch the required data from the database/table",engine)

print(df.head())

In [3]:
##Example

import pandas as pd
import numpy as np
import psycopg2
from sqlalchemy import create_engine

engine=create_engine("postgresql+psycopg2://postgres:password@localhost:5432/Employee")

df=pd.read_sql("select * from datasql",engine)

print(df.head())

   id          name  age     gender       city           state  occupation  \
0   2   Sonam Gupta   28       Male         NA     Maharashtra     Student
1   3    Isha Patel   36  Not Known  Bengaluru  Madhya Pradesh      Banker
2   4   Arjun Mehta   38  Not Known    Kolkata     West Bengal  Researcher
3   5  Vikram Reddy   24  Not Known  Bengaluru           Assam  Researcher
4   6  Rajesh Kumar   32     Female     Jaipur      Tamil Nadu  Accountant

   salary       phone  manager_id salary_status
0   73786  8426936077        1003          None
1   66534  8228788233        1007          None
2   66534   755532986        1019          None
3   66534  1774591513        1013          None
4   66534  7299977873        1017          None

In [4]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 220 entries, 0 to 219
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             220 non-null    int64
 1   name           220 non-null    object
 2   age            220 non-null    int64
 3   gender         220 non-null    object
 4   city           220 non-null    object
 5   state          220 non-null    object
 6   occupation     220 non-null    object
 7   salary         220 non-null    int64
 8   phone          220 non-null    int64
 9   manager_id     220 non-null    int64
 10  salary_status  0 non-null      object
dtypes: int64(5), object(6)
memory usage: 19.0+ KB
None

In [6]:
print(df.isnull().sum())

id                 0
name               0
age                0
gender             0
city               0
state              0
occupation         0
salary             0
phone              0
manager_id         0
salary_status    220
dtype: int64

In [7]:
print(df['name'].isnull().sum())

0

In [12]:
print(df.duplicated('state').sum())

206

In [15]:
df.fillna(value=0, inplace=True)
print(df)

      id            name  age     gender        city           state  \
0      2     Sonam Gupta   28       Male          NA     Maharashtra
1      3      Isha Patel   36  Not Known   Bengaluru  Madhya Pradesh
2      4     Arjun Mehta   38  Not Known     Kolkata     West Bengal
3      5    Vikram Reddy   24  Not Known   Bengaluru           Assam
4      6    Rajesh Kumar   32     Female      Jaipur      Tamil Nadu
..   ...             ...  ...        ...         ...             ...
215   57    Sneha Pillai   31     Female  Chandigarh     West Bengal
216   75  Harsh Malhotra   37  Not Known      Mumbai      Tamil Nadu
217  105      Neha Singh   34  Not Known    Guwahati   Uttar Pradesh
218  117    Sonal Kapoor   31  Not Known        Pune           Bihar
219  178    Vikram Reddy   34     Female          NA         Gujarat

     occupation  salary       phone  manager_id  salary_status
0       Student   73786  8426936077        1003              0
1        Banker   66534  8228788233        1007              0
2    Researcher   66534   755532986        1019              0
3    Researcher   66534  1774591513        1013              0
4    Accountant   66534  7299977873        1017              0
..          ...     ...         ...         ...            ...
215     Analyst   65634  7859350588        1006              0
216     Analyst   66534  7524241477        1001              0
217     Analyst  104382   336902576        1009              0
218     Analyst   66534  9493056996        1001              0
219     Analyst  111739  7496119348        1020              0

[220 rows x 11 columns]

In [17]:
df['age'].fillna(df['age'].mean(),inplace=True)
print(df)

      id            name  age     gender        city           state  \
0      2     Sonam Gupta   28       Male          NA     Maharashtra
1      3      Isha Patel   36  Not Known   Bengaluru  Madhya Pradesh
2      4     Arjun Mehta   38  Not Known     Kolkata     West Bengal
3      5    Vikram Reddy   24  Not Known   Bengaluru           Assam
4      6    Rajesh Kumar   32     Female      Jaipur      Tamil Nadu
..   ...             ...  ...        ...         ...             ...
215   57    Sneha Pillai   31     Female  Chandigarh     West Bengal
216   75  Harsh Malhotra   37  Not Known      Mumbai      Tamil Nadu
217  105      Neha Singh   34  Not Known    Guwahati   Uttar Pradesh
218  117    Sonal Kapoor   31  Not Known        Pune           Bihar
219  178    Vikram Reddy   34     Female          NA         Gujarat

     occupation  salary       phone  manager_id  salary_status
0       Student   73786  8426936077        1003              0
1        Banker   66534  8228788233        1007              0
2    Researcher   66534   755532986        1019              0
3    Researcher   66534  1774591513        1013              0
4    Accountant   66534  7299977873        1017              0
..          ...     ...         ...         ...            ...
215     Analyst   65634  7859350588        1006              0
216     Analyst   66534  7524241477        1001              0
217     Analyst  104382   336902576        1009              0
218     Analyst   66534  9493056996        1001              0
219     Analyst  111739  7496119348        1020              0

[220 rows x 11 columns]

C:\Users\Prateek\AppData\Local\Temp\ipykernel_18384\2644800082.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['age'].fillna(df['age'].mean(),inplace=True)

In [18]:
df['name']=df['name'].str.lower()

In [19]:
df

,id,name,age,gender,city,state,occupation,salary,phone,manager_id,salary_status
0,2,sonam gupta,28,Male,NA,Maharashtra,Student,73786,8426936077,1003,0
1,3,isha patel,36,Not Known,Bengaluru,Madhya Pradesh,Banker,66534,8228788233,1007,0
2,4,arjun mehta,38,Not Known,Kolkata,West Bengal,Researcher,66534,755532986,1019,0
3,5,vikram reddy,24,Not Known,Bengaluru,Assam,Researcher,66534,1774591513,1013,0
4,6,rajesh kumar,32,Female,Jaipur,Tamil Nadu,Accountant,66534,7299977873,1017,0
...,...,...,...,...,...,...,...,...,...,...,...
215,57,sneha pillai,31,Female,Chandigarh,West Bengal,Analyst,65634,7859350588,1006,0
216,75,harsh malhotra,37,Not Known,Mumbai,Tamil Nadu,Analyst,66534,7524241477,1001,0
217,105,neha singh,34,Not Known,Guwahati,Uttar Pradesh,Analyst,104382,336902576,1009,0
218,117,sonal kapoor,31,Not Known,Pune,Bihar,Analyst,66534,9493056996,1001,0
219,178,vikram reddy,34,Female,NA,Gujarat,Analyst,111739,7496119348,1020,0

In [21]:
df['name']=df['name'].str.upper()
print(df)

      id            name  age     gender        city           state  \
0      2     SONAM GUPTA   28       Male          NA     Maharashtra
1      3      ISHA PATEL   36  Not Known   Bengaluru  Madhya Pradesh
2      4     ARJUN MEHTA   38  Not Known     Kolkata     West Bengal
3      5    VIKRAM REDDY   24  Not Known   Bengaluru           Assam
4      6    RAJESH KUMAR   32     Female      Jaipur      Tamil Nadu
..   ...             ...  ...        ...         ...             ...
215   57    SNEHA PILLAI   31     Female  Chandigarh     West Bengal
216   75  HARSH MALHOTRA   37  Not Known      Mumbai      Tamil Nadu
217  105      NEHA SINGH   34  Not Known    Guwahati   Uttar Pradesh
218  117    SONAL KAPOOR   31  Not Known        Pune           Bihar
219  178    VIKRAM REDDY   34     Female          NA         Gujarat

     occupation  salary       phone  manager_id  salary_status
0       Student   73786  8426936077        1003              0
1        Banker   66534  8228788233        1007              0
2    Researcher   66534   755532986        1019              0
3    Researcher   66534  1774591513        1013              0
4    Accountant   66534  7299977873        1017              0
..          ...     ...         ...         ...            ...
215     Analyst   65634  7859350588        1006              0
216     Analyst   66534  7524241477        1001              0
217     Analyst  104382   336902576        1009              0
218     Analyst   66534  9493056996        1001              0
219     Analyst  111739  7496119348        1020              0

[220 rows x 11 columns]

In [24]:
df['gender']=df['gender'].str.upper().replace({'MALE':'M','FEMALE':'F','NOT KNOWN':'NA'})
print(df)

      id            name  age gender        city           state  occupation  \
0      2     SONAM GUPTA   28      M          NA     Maharashtra     Student
1      3      ISHA PATEL   36     NA   Bengaluru  Madhya Pradesh      Banker
2      4     ARJUN MEHTA   38     NA     Kolkata     West Bengal  Researcher
3      5    VIKRAM REDDY   24     NA   Bengaluru           Assam  Researcher
4      6    RAJESH KUMAR   32      F      Jaipur      Tamil Nadu  Accountant
..   ...             ...  ...    ...         ...             ...         ...
215   57    SNEHA PILLAI   31      F  Chandigarh     West Bengal     Analyst
216   75  HARSH MALHOTRA   37     NA      Mumbai      Tamil Nadu     Analyst
217  105      NEHA SINGH   34     NA    Guwahati   Uttar Pradesh     Analyst
218  117    SONAL KAPOOR   31     NA        Pune           Bihar     Analyst
219  178    VIKRAM REDDY   34      F          NA         Gujarat     Analyst

     salary       phone  manager_id  salary_status
0     73786  8426936077        1003              0
1     66534  8228788233        1007              0
2     66534   755532986        1019              0
3     66534  1774591513        1013              0
4     66534  7299977873        1017              0
..      ...         ...         ...            ...
215   65634  7859350588        1006              0
216   66534  7524241477        1001              0
217  104382   336902576        1009              0
218   66534  9493056996        1001              0
219  111739  7496119348        1020              0

[220 rows x 11 columns]

      id            name  age     gender        city           state  \
0      2     SONAM GUPTA   28       Male          NA     Maharashtra
1      3      ISHA PATEL   36  Not Known   Bengaluru  Madhya Pradesh
2      4     ARJUN MEHTA   38  Not Known     Kolkata     West Bengal
3      5    VIKRAM REDDY   24  Not Known   Bengaluru           Assam
4      6    RAJESH KUMAR   32     Female      Jaipur      Tamil Nadu
..   ...             ...  ...        ...         ...             ...
215   57    SNEHA PILLAI   31     Female  Chandigarh     West Bengal
216   75  HARSH MALHOTRA   37  Not Known      Mumbai      Tamil Nadu
217  105      NEHA SINGH   34  Not Known    Guwahati   Uttar Pradesh
218  117    SONAL KAPOOR   31  Not Known        Pune           Bihar
219  178    VIKRAM REDDY   34     Female          NA         Gujarat

     occupation  salary       phone  manager_id  salary_status
0       Student   73786  8426936077        1003              0
1        Banker   66534  8228788233        1007              0
2    Researcher   66534   755532986        1019              0
3    Researcher   66534  1774591513        1013              0
4    Accountant   66534  7299977873        1017              0
..          ...     ...         ...         ...            ...
215     Analyst   65634  7859350588        1006              0
216     Analyst   66534  7524241477        1001              0
217     Analyst  104382   336902576        1009              0
218     Analyst   66534  9493056996        1001              0
219     Analyst  111739  7496119348        1020              0

[220 rows x 11 columns]